#   Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся
#   элементов исходной последовательности.



numbers = [11, 22, 3333, 2, 555, 98, 11, 2, 1, 22, 11]  # не получается ручной ввод

numSet = set(numbers)
   
print(numSet)

